
# coding: utf-8

# # 字符串
# - 转义字符
# - 格式化
# - 内建函数（后延）
# 
# ## 转义字符
# - 用一个特殊的方法表示出一系列不方便写出的内容，比如回车键，换行键，退格键
# - 将借助反斜杠，一旦字符串中出现反斜杠，则反斜杠后面一个火一个字符表示已经不是原来的意思了，进行了转义。
# 
# ## 格式化
# - 把字符串按照一定的格式打印或者填充
# - 格式化有两种方法
#   - 利用百分号（N)
#   - 利用format函数
# ### 利用百分号
# - 在字符串中，利用%表示一个特殊的含义
# - %d：此处应该放入一个整数
# - %s：表示此处应该放入一个字符串
# - 如果出现多个占位符，用括号括起来
# ### format格式化字符串
# - 直接用format函数进行格式化
# - 推荐使用这种方法
# - 在使用上用{}代替%，后面的用format括上参数完成

# ## None
# - 表示什么都没有
# - 如果函数没有返回值，可以返回None
# - 用来占位
# - 用来接触变量绑定

# # 表达式
# - 有一个或者几个数字或者变量和运算符合成的一行代码
# - 通常会返回一个结果
# 

# # 运算符
# - 由一个以上的值经过变化得到新值的过程叫做运算
# - 用用于运算的符号叫运算符
# - 运算的分类：
#   - 算数运算符
#    -  进行算数运算的符号
#   - 比较或者关系运算符
#    - 对两个变量或者值进行比较的运算符
#    - 比较的结果是布尔值，即True、False
#   - 赋值运算符
#   - 逻辑运算符
#   - 位运算符
#   - 成员运算符
#   - 身份运算符
#   
#   

# 
# 
